NISolve> test1
0.465571232262535
NISolve> test1'
3
NISolve> test1''
[0.4,0.47012987012987,0.46559120520335,0.465571232262535]
NISolve> test2
11.6450418633855
NISolve> test2'
3
NISolve> test2''
[12.0,11.6502916666667,11.6450430462071,11.6450418633855]
NISolve> test3
2.98099530288531
NISolve> test3'
5
NISolve> test3''
[4.0,3.38390625,3.06618180656813,2.98559901827501,2.98100947849264,2.98099530288
531]
NISolve> test4 0.0001
2.98099531193236
NISolve> test4' 0.0001
182
NISolve> test4 1234
2.98099530275747
NISolve> test4' 1234
31
NISolve>