SecSolve> test1
0.465571224650385
SecSolve> test1'
5
SecSolve> test1''
[0.4,0.6,0.457446808510638,0.464599255082285,0.465578915171487,0.465571224650385
]
SecSolve> test2
2.09455248518528
SecSolve> test2'
4
SecSolve> test2''
[2.0,2.2,2.08896797153025,2.09423295637861,2.09455248518528]